~/test-1-Prajwal120602-5$ gcc -g p3original.c
~/test-1-Prajwal120602-5$ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x722: file p3original.c, line 8.
(gdb) r
Starting program: /home/runner/test-1-Prajwal120602-5/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p3original.c:8
8     a=input();
(gdb) n
enter the number2
9     b=input();
(gdb) n
enter the number3
10    sum=add(a,b);
(gdb) s
add (a=2, b=3) at p3original.c:15
15    int add=a+b;
(gdb) p
The history is empty.
(gdb) c
Continuing.
the sum is 5[Inferior 1 (process 96) exited normally]
(gdb) l
10    sum=add(a,b);
11    output(sum);
12  }
13  int add (int a,int b)
14  {
15    int add=a+b;
16    return add;
17  }
18  int input()
19  {
(gdb) quit
~/test-1-Prajwal120602-5$ ^C
~/test-1-Prajwal120602-5$ 